# conditional selection

In [1]:
import pandas as pd 
import numpy as np

In [53]:
# setting the seed value so that all the genrated value are same 
np.random.seed(101)

In [54]:
# creating a data frame
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
# comparison opertor to genrate bool table
comp = df < 0

In [57]:
# passing boolean table in df to get the values 

print(df[comp])

# getting values by directly passing the comparison instead of boolean values  
df[df<0]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

In [58]:
# conditional selection of a column 
# genrating boolean table for a column
col_comp = df['W'] < 0 

print(col_comp)

# passing the boolean for column into data frame 
df[col_comp]
# can also specify the column to be viewed 
df[col_comp]['W']


# the comparison can be directly done inside the index of the dataframe instea of passing the boolean table

A    False
B    False
C     True
D    False
E    False
Name: W, dtype: bool

C   -2.018168
Name: W, dtype: float64

In [59]:
# getting particular column after the comparsion 

print(df[df['W']<0.5])

# storing the result in a variable

res = df[df['W']<0.5]

# using the result to view a particular columns

res['Y']

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [74]:
# seeing only specified columns 
df[df['X']>1][['X','Y']]

          X         Y
E  1.978757  2.605967

In [73]:
# for more than 2 condition and-> & or->| 
# format -> df[( df[]<1 ) & ( df[]<1 )]



print(df[(df['W']>1)| (df['Y']<1)])
print(df[(df['X']<1) & (df['Y']<1)])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [77]:
# resetting index 

df.reset_index()
# making it permanent 
df.reset_index(inplace=True)
df

   level_0 index         W         X         Y         Z
0        0     A  2.706850  0.628133  0.907969  0.503826
1        1     B  0.651118 -0.319318 -0.848077  0.605965
2        2     C -2.018168  0.740122  0.528813 -0.589001
3        3     D  0.188695 -0.758872 -0.933237  0.955057
4        4     E  0.190794  1.978757  2.605967  0.683509

In [83]:
df.drop('level_0',axis=1,inplace=True)

In [90]:
# dropping our index 
df.drop('index',axis=1,inplace=True)
df

          W         X         Y         Z   state
0  2.706850  0.628133  0.907969  0.503826     raj
1  0.651118 -0.319318 -0.848077  0.605965      kl
2 -2.018168  0.740122  0.528813 -0.589001     J&K
3  0.188695 -0.758872 -0.933237  0.955057  andhra
4  0.190794  1.978757  2.605967  0.683509      TN

In [89]:
# creating a new column and adding it as a index 

# using split method to creat a list

state = 'raj kl J&K andhra TN'.split()
state

# adding it to the data frame 

df['state'] = state

          W         X         Y         Z   index   state
0  2.706850  0.628133  0.907969  0.503826     raj     raj
1  0.651118 -0.319318 -0.848077  0.605965      kl      kl
2 -2.018168  0.740122  0.528813 -0.589001     J&K     J&K
3  0.188695 -0.758872 -0.933237  0.955057  andhra  andhra
4  0.190794  1.978757  2.605967  0.683509      TN      TN

In [93]:
# setting the newley added column as a index 

df.set_index('state',inplace=True)

In [94]:
df

               W         X         Y         Z
state
raj     2.706850  0.628133  0.907969  0.503826
kl      0.651118 -0.319318 -0.848077  0.605965
J&K    -2.018168  0.740122  0.528813 -0.589001
andhra  0.188695 -0.758872 -0.933237  0.955057
TN      0.190794  1.978757  2.605967  0.683509